Repository: mkappus1/DatenmanagementMTHS24
Catalog: Woche 2/Skripte/TMX-EN-DE/tmx_teil_4.tmx
Source language: de
Languages: en

source: Schalen für Nüsse
en: Bowls for nuts

source: Gusseisenplatten [nicht elektrische Kochgeräte]
en: Griddles [non-electric cooking utensils]

source: Elektrische und nicht elektrische Korkenzieher
en: Corkscrews, electric and non-electric

source: Hitzebeständige Untersetzer
en: Oven heat resistant pads

source: Elektrische Mundduschen für den persönlichen Gebrauch
en: Periodontal irrigators [electric] for personal use

source: Übertöpfe aus Porzellan
en: Porcelain flower pots

source: Spender für Flüssigseife [für den Haushalt]
en: Dispensers for liquid soap [for household purposes]

source: Gläser [Trinkgefäße]
en: Glasses [drinking vessels]

source: Glaswaren für den Haushalt
en: Glassware for household purposes

source: Kaffeekannen
en: Coffee pots

source: Interdentalbürsten zum Reinigen der Zähne
en: Interdental brushes for cleaning the teeth

source: Gefäße für Haushaltszwecke
en: Jars for household use

source: Kosmetische Geräte
en: Cosmetic utensils

source: Isolierbehälter, -gefäße
en: Heat-insulated containers

source: Formen [Küchenartikel]
en: Moulds [kitchen utensils]

source: Zahnstocher
en: Toothpicks

source: Behälter-Sets
en: Canister sets

source: Schalen aus Edelmetall
en: Bowls of precious metal

source: Elektrische Haarkämme
en: Electric hair combs

source: Mopps
en: Mops

source: Kunststoffschüsseln [Haushaltsbehälter]
en: Plastic bowls [household containers]

source: Teemützen, -wärmer
en: Planters of plastic

source: Schwämme
en: Sponges

source: Backschüsseln aus Porzellan
en: Baking dishes made of porcelain

source: Stützstangen für Topfpflanzen
en: Pot plant support sticks

source: Handbetätigte Nudelmaschinen
en: Noodle machines, hand-operated

source: Spatel für die Küche
en: Spatulas for kitchen use

source: Zehentrenner aus Schaumstoff für die Pediküre
en: Foam toe separators for use in pedicures

source: Badezimmer-Eimer
en: Bathroom pails

source: Tassen, nicht aus Edelmetall
en: Cups, not of precious metal

source: Applikatoren zum Auftragen von Augen-Make-up
en: Applicators for applying eye make-up

source: Künstliche Schwämme für Haushaltszwecke
en: Artificial sponges for household purposes

source: Gießtüllen für Haushaltszwecke
en: Pouring spouts for household use

source: Zerstäuber für Parfüm
en: Scent sprays [atomizers]

source: Mülleimer
en: Dustbins

source: Artikel für die Zahnreinigung
en: Dental cleaning articles

source: Aquarien und Vivarien
en: Aquaria and vivaria

source: Geschirr, Kochgeschirr und Behälter
en: Tableware, cookware and containers

source: Gläser, Trinkgefäße und Barzubehör
en: Glasses, drinking vessels and barware

source: Kosmetik- und Toiletteutensilien sowie Badezimmerartikel
en: Cosmetic and toilet utensils and bathroom articles

source: Statuen, Figuren, Schilder und Kunstwerke aus Materialien wie Porzellan, Keramik, Steingut und Glas, soweit in dieser Klasse enthalten
en: Statues, figurines, plaques and works of art, made of materials such as porcelain, terra-cotta or glass, included in the class

source: Haushalts- oder Küchenutensilien
en: Household or kitchen utensils

source: Kosmetische Spatel
en: Cosmetic spatulas

source: Ornament-Flachglas, nicht für Bauzwecke
en: Figured plate glass, not for building

source: Abfalleimer für Haushaltszwecke
en: Waste bins for household use

source: Vogelbäder, keine Konstruktionen
en: Bird baths not being structures

source: Isoliermanschetten für Dosen, um deren Inhalt warm oder kalt zu halten
en: Thermal insulated wrap for cans to keep the contents cold or hot

source: Nicht elektrische Kaffeeaufschäumer
en: Non-electric coffee frothers

source: Handbetätigte Skibürsten
en: Hand-operated ski brushes

source: Kühlakkus zum Kühlen von Speisen und Getränken
en: Cold packs for chilling food and beverages

source: Sparbüchsen
en: Coin banks

source: Stößel für die Küche
en: Pestles for kitchen use

source: Mörser für die Küche
en: Mortars for kitchen use

source: Handbetätigte Geräte zum Öffnen von Austern
en: Implements (Hand operated -) for cracking lobsters

source: Suribachi [Keramikmörsel im japanischen Stil]
en: Japanese style earthenware mortars [suribachi]

source: Nichtelektrische Nudelmaschinen für den Haushalt
en: Non-electric pasta makers for domestic use

source: Nussöffner, nicht aus Edelmetall
en: Nutcrackers not of precious metal

source: Nussknacker aus Edelmetall
en: Nutcrackers of precious metal

source: Serviergabeln für Pasta
en: Pasta serving forks

source: Besenstiele, nicht aus Metall
en: Broom handles, not of metal

source: Bürstenstiele, nicht aus Metall
en: Handles (Non-metallic -) for brushes

source: Bürstengriffe aus Kunststoff
en: Handles made of plastics for brushes

source: Nussknacker
en: Nutcrackers

source: Besenstiele
en: Broom handles

source: Schöpfkellen für Wein
en: Ladles for serving wine

source: Dosen aus Edelmetall für Süßigkeiten
en: Boxes of precious metal for sweets

source: Bürsten für Pfeifen
en: Brushes for pipes

source: Halter zur Aufbewahrung von Haaraccessoires für Haushalts- und Heimzwecke
en: Caddies for holding hair accessories for household and domestic use

source: Kerzenlöscher, nicht aus Edelmetall
en: Candle extinguishers, not of precious metal

source: Kerzenhalter, nicht aus Edelmetall
en: Candle holders not of precious metal

source: Kerzenhalter aus Edelmetall
en: Candle holders of precious metal

source: Kerzenringe aus Edelmetall
en: Candle rings of precious metal

source: Leuchter aus Edelmetall
en: Candlesticks of precious metal

source: Kerzenleuchter mit Windschutz
en: Candlesticks with wind protection

source: Bonbonnieren, nicht aus Edelmetall
en: Candy boxes, not of precious metal

source: Cocktail-Gläser
en: Cocktail glasses

source: Kaffeekannen, nicht aus Edelmetall
en: Coffee pots not of precious metal

source: Kaffeeservices aus Edelmetall
en: Coffee services of precious metal

source: Kochtöpfe und -pfannen [nicht elektrisch]
en: Cooking pots and pans [non-electric]

source: Essig- und Ölständer aus Edelmetall
en: Cruet stands of precious metal

source: Plattmenagen [nicht aus Edelmetall]
en: Cruets not of precious metal

source: Mokkasets, bestehend aus Mokkatassen und -untertassen
en: Demitasse sets comprised of cups and saucers

source: Trocknenplatten für gewaschene, gestärkte und dann gestreckte Teile von Kimonos [Hari-ita]
en: Drying boards for washed, starched and then stretched pieces of kimono (hari-ita)

source: Eierbecher aus Edelmetall
en: Egg cups of precious metal

source: Tafelaufsätze aus Edelmetallen
en: Epergnes of precious metals

source: Behälter für den Haushalt aus Edelmetall
en: Household containers of precious metal

source: Japanische nichtelektrische Kessel aus Gusseisen [Tetsubin]
en: Japanese cast iron kettles, non-electric (tetsubin)

source: Japanische Reisschüsseln, nicht aus Edelmetall [Chawan]
en: Japanese rice bowls not of precious metal (chawan)

source: Japanische Reisschüsseln aus Edelmetall [Chawan]
en: Japanese rice bowls of precious metal (chawan)

source: Japanische Suppenschüsseln [Wan]
en: Japanese style soup serving bowls (wan)

source: Japanische Teekannen aus Edelmetall [Kyusu]
en: Japanese style tea-serving pots of precious metal (kyusu)

source: Holzstößel in japanischem Stil [Surikogi]
en: Japanese style wooden pestles (surikogi)

source: Becher, nicht aus Edelmetall
en: Mugs, not of precious metal

source: Serviettenhalter, nicht aus Edelmetall
en: Napkin holders, not of precious metal

source: Serviettenringe, nicht aus Edelmetall
en: Napkin rings, not of precious metal

source: In neun Teilstücke unterteilte Lackservierplatte [Gujeolpan]
en: Nine sectioned lacquer ware serving plates (Gujeolpan)

source: Abfallbehälter für Haushaltszwecke, nicht aus Metall
en: Non-metal recycling bins for household use

source: Hors d'Oeuvre-Teller
en: Plates for hors d'oeuvre

source: Tragbare Halter für Getränkebehälter
en: Portable beverage container holders

source: Tragbare Campingtöpfe und -pfannen
en: Portable pots and pans for camping

source: Puderdosen aus Edelmetall [ungefüllt]
en: Powder compacts of precious metal [sold empty]

source: Marderhundhaar für Pinsel
en: Raccoon dog hair for brushes

source: Sakeschälchen, nicht aus Edelmetall
en: Sake cups [not of precious metal]

source: Sakeservierflaschen [Tokkuri]
en: Sake serving bottles (tokkuri)

source: Salzstreuer aus Edelmetall
en: Salt shakers of precious metal

source: Untertassen aus Edelmetall
en: Saucers made of precious metals

source: Untertassen, nicht aus Edelmetall
en: Saucers not of precious metals

source: Servierschüsseln [Hachi]
en: Serving bowls (hachi)

source: Zuckerdosen aus Edelmetall
en: Sugar bowls of precious metal

source: Trinkkrüge aus Edelmetall
en: Tankards of precious metal

source: Teeeier, nicht aus Edelmetall
en: Tea infusers not of precious metal

source: Teekannen aus Edelmetall
en: Tea pots of precious metal

source: Teeservices, nicht aus Edelmetall
en: Tea services not of precious metal

source: Teeservices aus Edelmetall
en: Tea services of precious metal

source: Teetassen [Yunomi]
en: Teacups (yunomi)

source: Isoliertaschen für Nahrungsmittel und Getränke
en: Thermal insulated bags for food or beverages

source: Isolierbehälter für Lebensmittel und Getränke
en: Thermal insulated containers for food or beverage

source: Zahnstocherbehälter aus Edelmetall
en: Toothpick holders of precious metal

source: Drahtflachglas, nicht für Bauzwecke
en: Wired plate glass, not for building

source: Glasdeckel für Verpackungsbehälter für gewerbliche Zwecke
en: Glass lids for industrial packaging containers

source: Gießlöffel [Küchenutensilien]
en: Basting spoons [cooking utensils]

source: Handbetriebene Pfeffermühlen
en: Pepper mills, hand-operated

source: Glasballons [Behälter]
en: Glass flasks [containers]

source: Spritzen für Gartenschläuche
en: Spray nozzles for garden hoses

source: Reiben für die Küche
en: Graters for kitchen use

source: Löchersiebe für den Haushalt
en: Strainers for household purposes

source: Siebe für Haushaltzwecke
en: Colanders for household use

source: Küchengeräte
en: Cooking pot sets

source: Papierhandtuchspender aus Metall
en: Boxes for dispensing paper towels

source: Tücher zur Staubentfernung
en: Dusting cloths [rags]

source: Staubtücher
en: Mouse traps

source: Glas für Kraftfahrzeugscheiben [Halbfabrikate]
en: Glass for vehicle windows [semi-finished product]

source: Nicht elektrische Schnellkochtöpfe
en: Autoclaves, non-electric, for cooking

source: Nicht elektrische Dampfkochtöpfe
en: Hot pots, not electrically heated

source: Formen für Eiswürfel
en: Ice cube molds [moulds]

source: Eiswürfelformen für Kühlschränke
en: Ice cube molds for refrigerators

source: Bierkrüge
en: Beer mugs

source: Schuhspanner [Leisten]
en: Shoe trees [stretchers]

source: Stiefelspanner [Leisten]
en: Boot trees [stretchers]

source: Kerzenglas [Kerzenhalter]
en: Candle jars [holders]

source: Nicht elektrische Dampfgarer
en: Food steamers, non-electric

source: Grillkratzer [Reinigungsartikel]
en: Grill scrapers [cleaning articles]

source: Reinigungsbürsten für Sportausrüstung
en: Cleaning brushes for sports equipment

source: Steak-Gewichte
en: Steak weights

source: Krüge, nicht aus Edelmetall
en: Jugs, not of precious metal

source: Blumenschalen aus Edelmetall
en: Flower bowls of precious metal

source: Glasstäbe, nicht für Bauzwecke
en: Glass bars, not for building

source: Zimmerterrarien für Tiere
en: Indoor terrariums for animals

source: Zimmerterrarien für Insekten
en: Indoor terrariums for insects

source: Teller, nicht aus Edelmetall
en: Plates not of precious metal

source: Stangen für Handtücher, nicht aus Edelmetall
en: Rails for towels, not of precious metal

source: Ringe für Handtücher, nicht aus Edelmetall
en: Rings for towels, not of precious metal

source: Handtuchringe, nicht aus Edelmetall
en: Towel rings, not of precious metal

source: Kompostierbare Teller
en: Compostable plates

source: Plattmenagen aus Edelmetall
en: Cruets of precious metal

source: Geschirr, nicht aus Edelmetall
en: Dishes not of precious metal

source: Eisschaufeln [Barzubehör]
en: Ice scoops [barware]

source: Portionierer [Haushalts- oder Küchenutensilien]
en: Serving scoops [household or kitchen utensil]

source: Reisschaufeln [Servierlöffel für gekochten Reis]
en: Rice paddles [cooked rice serving scoops]

source: Dessertteller
en: Dessert plates

source: Mehrweg-Wasserflaschen aus beschichtetem Stahl
en: Reusable stainless steel water bottles

source: Glaskartuschen für Arzneimittel, leer
en: Glass cartridges for medication, empty

source: Mundpflegesets bestehend aus Zahnbürsten und Zahnseide
en: Oral care kits comprising toothbrushes and floss

source: Bodenvasen aus Stein
en: Stone floor vases

source: Wäschesortierer für Haushaltszwecke
en: Laundry sorters for household use

source: Bodenvasen aus Ton
en: Clay floor vases

source: Köderstationen, leer, zur Verfütterung von Rodentiziden an Nager
en: Bait stations, empty, for feeding rodenticides to rodents

source: Aluminiumwasserflaschen, leer
en: Aluminum water bottles, empty

source: Halter für Plastikbeutel, für Haushaltszwecke
en: Plastic bag holders for household use

source: Kompostbehälter für Haushaltszwecke
en: Compost containers for household use

source: Gefäße für Speisefett, leer
en: Jars for cooking grease, empty

source: Serviertabletts aus Rattan
en: Serving trays made of rattan

source: Spender für Zellstofftücher, für Haushaltszwecke
en: Dispensers for cellulose wipes, for household use

source: Glasrohre zum Herstellen von Schildern
en: Glass tubing for use in making signs

source: Weintropfmanschetten, speziell angepasst zur Verwendung um den Weinflaschenhals, um Tropfen zu verhindern
en: Wine drip collars specially adapted for use around the top of wine bottles to stop drips

source: Mundduschen mit Hochdruckwasserreinigung für den Hausgebrauch
en: Apparatus for cleaning teeth and gums using high pressure water for home use

source: Plastikeimer zum Aufbewahren von Badespielzeug
en: Plastic buckets for storing bath toys

source: Bürsten zum Reinigen von Fahrradelementen
en: Brushes for cleaning bicycle components

source: Spender für Kosmetiktücher
en: Dispensers for facial tissues

source: Filter für Katzentoiletten
en: Filters for use in cat litter pans

source: Kuchendekorationen aus Porzellan
en: Porcelain cake decorations

source: Popcorndosen, leer, für Haushaltszwecke
en: Popcorn tins, empty, for household use

source: Lotionbehälter, leer, für Haushaltszwecke
en: Lotion containers, empty, for household use

source: Wasser- und Futternäpfe für Haustiere
en: Pet feeding and drinking bowls

source: Nichtelektrische Wandleuchter [Kerzenhalter]
en: Non-electric wall sconces [candle holders]

source: Bürsten zur Reinigung von Autoreifen
en: Automobile wheel cleaning brushes

source: Vakuumpumpen für Weinflaschen
en: Vacuum pumps for wine bottles

source: Trinklerntassen für Babys und Kinder
en: Training cups for babies and children

source: Tücher zum Reinigen von Glasfasersteckern
en: Optical fiber connector cleaning cloths

source: Isolierte Deckel für Teller und Schalen
en: Insulated lids for plates and dishes

source: Isolierbehälter für Getränkedosen, für Haushaltszwecke
en: Insulated containers for beverage cans, for domestic use

source: Angepasste Deckel für Müllcontainer
en: Fitted trash receptacle covers

source: Biologisch abbaubare Teller auf Zellstoffbasis
en: Biodegradable paper pulp-based plates

source: Grillbretter aus Holz
en: Grilling planks of wood

source: Teilweise bearbeitet Drahtglas
en: Semi-finished safety glass

source: Rahmen zum Trocknen und Erhalten der Form von Kleidungsstücken
en: Frames for drying and maintaining the shape of clothing items

source: Bürsten zum Pflegen von Putting Grün
en: Brushes for grooming golf putting greens

source: Elektrisch beheizte Haarbürsten
en: Electrically heated hair brushes

source: Eierbecher, nicht aus Edelmetall
en: Egg cups, not of precious metal

source: Sparbüchsen, nicht aus Edelmetall
en: Coin banks, not of precious metal

source: Schilder aus Glas
en: Glass signboards

source: Schilder aus Porzellan
en: Porcelain signboards

source: Wasserflaschen für Fahrräder
en: Water bottles for bicycles

source: Sparbüchsen aus Edelmetall
en: Coin banks of precious metal

source: Trinkbecher aus Edelmetall
en: Mugs of precious metal

source: Tassen aus Edelmetall
en: Cups of precious metal

source: Biologisch abbaubare Tabletts für den Haushalt
en: Biodegradable trays for domestic purposes

source: Kompostierbare Tabletts für Haushaltszwecke
en: Compostable trays for domestic purposes

source: Küchengeräte [nicht aus Edelmetall]
en: Kitchen utensils, not of precious metal

source: Nichtmechanische Tierfutterspender
en: Non-mechanized animal feeders

source: Kerzenringe, nicht aus Edelmetall
en: Candle rings, not of precious metal

source: Mikrodermabrasionsschwämme für kosmetische Zwecke
en: Microdermabrasion sponges for cosmetic use

source: Kühlregale für Backwaren
en: Cooling racks for baked goods

source: Kandelaber, nicht elektrisch
en: Non-electric candelabra

source: Puderdosen aus Edelmetall
en: Powder compacts of precious metal

source: Futtertröge für Pferde
en: Mangers for horses

source: Futtertröge für Kühe
en: Mangers for cows

source: Tablettendosen [nicht für medizinische Zwecke]
en: Pill boxes [not for medical purposes]

source: Spüllappen zum Abspülen von Geschirr
en: Dishcloths for washing dishes

source: Blumenvasen für Rituale
en: Ritual flower vases

source: Medizinische Zahnseide
en: Medicated dental floss

source: Dekoratives Buntglas
en: Decorative stained glass

source: Rasierpinsel aus Dachshaar
en: Shaving brushes of badger hair

source: Badewannentablett [Hilfsmittel]
en: Plastic bath racks [caddies]

source: Zierkugeln aus Glas
en: Ornamental glass spheres

source: Metallfuttertröge für Rinder
en: Feeding troughs of metal for cattle

source: Metallschalen für Rinder
en: Metal pans for cattle

source: Schrubber
en: Hard brooms

source: An einem Moppstiel anbringbare Applikatoren für Bodenwachs
en: Floor wax applicators mountable on a mop handle

source: Figuren aus Glasfaser
en: Fiberglass figurines

source: Elektrische Fusselentferner
en: Electric lint removers

source: Einwegbackgeschirr aus Pappe
en: Disposable paperboard bakeware

source: Bürsten zum Reinigen von Musikinstrumenten
en: Brushes for cleaning musical instruments

source: Bürsten zum Gebrauch auf Baumrinden
en: Brushes for use on tree bark

source: Bürsten für Parkettfußböden
en: Brushes for parquet floors

source: Schuhspanner aus Holz
en: Boot stretchers of wood

source: Tragbare Allzweckhaushaltskisten
en: All-purpose portable household containers

source: Scheuerkissen für die Küche oder Haushaltszwecke
en: Abrasive pads for kitchen or domestic purposes

source: Speiseeisbereiter, nicht elektrisch
en: Non-electric ice cream makers

source: Reiskochtöpfe, nicht elektrisch
en: Non-electric rice cooking pots

source: Pfannen, nicht elektrisch
en: Non-electric cooking pans

source: Verpackungen für Eis für Haushaltszwecke
en: Containers for ice, for household purposes

source: Serviertabletts aus Edelmetall
en: Serving trays of precious metal

source: Servierplatten aus Edelmetall
en: Serving platters of precious metal

source: Kaffeespender aus Edelmetall, nicht elektrisch
en: Non-electric coffee servers of precious metal

source: Kandelaber, nicht elektrisch, aus Edelmetall
en: Non-electric candelabras of precious metal

source: Ölkännchen aus Edelmetall
en: Oil cruets of precious metal

source: Wäschekörbe für Haushaltszwecke
en: Laundry baskets for household purposes

source: Nicht elektrische Tortillapressen [Küchengeräte]
en: Tortilla presses, non-electric [kitchen utensils]

source: Kohlebehälter für Haushaltszwecke
en: Coal buckets for household use

source: Emailliertes Glas, nicht für Bauzwecke
en: Enamelled glass, not for building

source: Haarbürsten
en: Hairbrushes

source: Salzfässchen aus Edelmetall
en: Salt cellars of precious metal

source: Seifenbehälter
en: Soap containers

source: Backbleche
en: Cookie sheets

source: Krüge aus Edelmetall
en: Jugs of precious metal

source: Teppichreiniger, nicht elektrisch
en: Non-electric carpet cleaners

source: Kaffeeservices, nicht aus Edelmetall
en: Coffee services, not of precious metal

source: Tafelaufsätze, nicht aus Edelmetall
en: Epergnes, not of precious metal

source: Bonbonnieren aus Edelmetall
en: Candy boxes of precious metal

source: Plastikformen für Stieleis
en: Plastic ice pop forms

source: Grillpfannen aus Edelsteinen
en: Grill pans made of precious stone

source: Leere Shaker-Flaschen
en: Shaker bottles sold empty

source: Eisskulpturen für dekorative Zwecke
en: Ice sculptures for decorative purposes

source: Zahnbürsten für Haustiere
en: Toothbrushes for pets

source: Serviettenringe
en: Napkin rings

source: Statuen aus Porzellan, Keramik, Steingut oder Glas
en: Statues of porcelain, ceramic, earthenware or glass

source: Figuren [Statuetten] aus Porzellan, Keramik, Steingut oder Glas
en: Figurines [statuettes] of porcelain, ceramic, earthenware or glass

source: Angepasste Ablagen für Hautpflegecremes
en: Fitted racks for skin care creams

source: Angepasste Ablagen für Haarfestiger
en: Fitted racks for hair fixers

source: Ablagen für Kosmetika
en: Racks for cosmetics

source: Angepasste Halter für Hautcremes
en: Fitted holders for skin creams

source: Nicht elektrische Sturmlampen
en: Hurricane lamps (non-electrical)

source: Angepasste Halter für Haarfestiger
en: Fitted holders for hair fixers

source: Halter für Kosmetika
en: Holders for cosmetics

source: Spender für Hautpflegecremes
en: Skin care cream dispensers

source: Spender für Haarfestiger
en: Hair fixer dispensers

source: Dosierspender für Kosmetika
en: Dispensers for cosmetics

source: Nicht ortsfeste Handtuchspender
en: Hand towel dispensers, other than fixed

source: Angepasste Halter für Papier zum Abtrocknen, Trocknen, Polieren und Reinigen
en: Fitted holders for wiping, drying, polishing and cleaning paper

source: Angepasste Spender für Papier zum Abtrocknen, Trocknen, Polieren und Reinigen
en: Fitted dispensers for wiping, drying, polishing and cleaning paper

source: Siebe [Haushaltsgeräte]
en: Sifters [household utensils]

source: Seiher [Haushaltsgeräte]
en: Sieves [household utensils]

source: Oszillierende Schallbürsten für die Hautpflege
en: Sonic oscillating brushes for skincare

source: Fellbürsten für Tiere
en: Fur brushes for animals

source: Reiskocher zur Verwendung in Mikrowellenherden
en: Rice cookers for use in microwave ovens

source: Kochtöpfe zur Verwendung in Mikrowellenherden
en: Cooking pots for use in microwave ovens

source: Nicht elektrische Eieröffner für Haushaltszwecke
en: Non-electric egg crackers for household use

source: Teigtaschenformer für Haushaltszwecke
en: Dumpling moulds for household use

source: Batteriebetriebene Zahnseidenhalter
en: Battery-powered dental flossers

source: Rollmatten für Sushi
en: Sushi rolling mats

source: Zubehör zum Rollen von Sushi
en: Sushi rolling equipment

source: Glasstöpsel für Flaschen
en: Glass stoppers for bottles

source: Nachfüllbare Kaffeekapseln
en: Refillable coffee capsules

source: Nachfüllbare Teekapseln
en: Refillable tea capsules

source: Transportable Milchpulverspender
en: Portable dispensers for powdered milk

source: Sparbüchsen [Sparschweine]
en: Coin banks (Piggy banks)

source: Japanische Reisschüsseln [Chawan]
en: Japanese rice bowls [chawan]

source: Reislöffel in japanischem Stil [Shamoji]
en: Japanese style cooked rice scoops [shamoji]

source: Bügelbretter
en: Ironing boards

source: Küchengeräte aus Silikon
en: Kitchen utensils of silicon
